import React from "react";
import { Helmet } from "react-helmet";
// import img1 from "../../../assets/islam/img-title/กฎหมายมรดก.png";
import "./posts-islam.css"

const ทายาทอิส = () => {
  const TITLE = "กฎหมายมรดกอิสลาม";

  return (
    <>
      <Helmet>
        <title>{TITLE}</title>
      </Helmet>

      <div className="content">
        <br></br>
        <p>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>ทายาท</b> หมายถึง บุคคลที่มีสิทธิรับมรดกของผู้ตาย แต่ไม่รวมถึงผู้รับพินัยกรรม โดยผู้ที่เป็นทายาทของผู้ตายจะต้องมีคุณสมบัติที่ถูกกำหนดไว้
        </p>

        {/* 1. คุณสมบัติของผู้ที่เป็นทายาท */}
        <h2 id="initial-header">1. คุณสมบัติของผู้ที่เป็นทายาท</h2>
        <p>
            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            ทายาทที่มีสิทธิรับมรดกจะต้องมีคุณสมบัติดังต่อไปนี้

            <br></br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            <b>1. ต้องเป็นญาติหรือคู่สมรส</b>ที่ถูกต้องตามหลักกฎหมายอิสลามของผู้ตายเท่านั้น
                <br></br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ญาติที่ไม่มีสิทธิได้รับมรดก -- เช่น การสมรสระหว่างบิดาและมารดาของบุตรไม่ถูกต้องตามหลักอิสลาม จะไม่ถือว่าบิดากับบุตรเป็นทายาทซึ่งกันและกัน
                <br></br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;คู่สมรสที่ไม่มีสิทธิได้รับมรดก -- เช่น สามีกับภรรยาเมื่อปรากฏว่าการสมรสระหว่างทั้งสองนั้นไม่ถูกต้องตามหลักอิสลาม                                               
                
            <br></br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            <b>2. ต้องนับถืออิสลามเหมือนกับเจ้ามรดก</b> หากผู้ตาย (เจ้ามรดก) นับถืออิสลาม ทายาทที่มีสิทธิรับมรดกจำเป็นต้องนับถือศาสนาอิสลามเช่นเดียวกับเจ้ามรดก                                                                         
            
            <br></br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            <b>3. จะต้องไม่เป็นผู้ที่ฆ่าเจ้ามรดก</b> ไม่ว่าด้วยเจตนาหรือประมาทอย่างร้ายแรง
            
            <br></br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            <b>4. จะต้องมีสภาพเป็นบุคคลขณะที่เจ้ามรดกถึงแก่ความตาย</b> ทายาทที่ถึงแก่ความตายก่อนหรือพร้อมกันกับเจ้ามรดกถึงแก่ความตาย ทายาทผู้นั้นจะไม่มีสิทธิรับมดกของเจ้ามรดก <mark className=" bg-[#fee9b2] rounded-xl">เว้นแต่ทายาทที่ป็นทารกในครรภ์มารดา ถึงแม้จะยังไม่มีสภาพเป็นบุคคลโดยสมบูรณ์</mark>{" "}
            
            <br></br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            <b>5. จะต้องไม่ถูกกันสิทธิ</b>ในการรับมรดกโดยผู้หนึ่งผู้ใด
        </p>

        {/* 2. ประเภทของทายาท */}
        <h2 id="second-header">2. ประเภทของทายาท</h2>
        <p>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;อาริฟ คอลีล อาบูอีด ได้แบ่งทายาทที่มีสิทธิได้รับมรดกออกเป็น 4 ประเภทคือ
          <br></br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            <b>1. อัศฮาบุลฟุรูฎ (الصحاب الفروض)</b> หมายถึง ทายาทที่ได้ถูกกำหนดสัดส่วนของสิทธิอย่างชัดเจนในอัลกรุอ่าน อัสสุนนะฮฺ หรือ อิจญ์มาอฺ โดยทายาทประเภทอัศฮาบุลฟุรูฎถูกแบ่งออกเป็น 2 กลุ่ม ดังนี้
              <br></br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              <b>1.1 อัศฮาบุลฟูรูฎ อันนะสะบียะห์ (اصحاب الفروض النسبية) </b> คือ กลุ่มทายาทที่มีสิทธิในการรับมรดกแบบอัตราส่วนที่ถูกกำหนดส่วนที่กำหนดไว้ในอัลกุรอ่าน อัสสุนนะฮฺ หรือ อิจญ์มาอฺ
              เนื่องจากมีความใกล้ชิดทางสายเลือดกับผู้ตาย (เจ้ามรดก)
              <br></br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-- เช่น บิดามาราดาของผู้ตาย บุตรหญิงของผู้ตาย หรืออาจเป็นพี่หรือน้องหญิงร่วมบิดามารดากับผู้ตาย เป็นต้น
              
              <br></br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              <b>1.2 อัศฮาบุลฟูรูฎ อัสสะบาบียะห์ (اصحاب الفروض السببية) </b> คือ กลุ่มทายาทที่มีสิทธิในการรับมรดก เนื่องจากมีการสมรสระหว่างกัน หรือก็คือสามีภรรยา ซึ่งถูกกำหนดไว้ในอัลกุรอ่าน อัสสุนนะฮฺ หรือ อิจญ์มาอฺ
            
            <br></br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ซึ่งทายาทประเภทที่ 1. อัศฮาบุลฟุรูฎ (الصحاب الفروض) ซึ่งเป็นทายาทประเภทที่มีสิทธิรับส่วนกำหนดตามที่กำหนดไว้ โดยถูกแบ่งออกเป็น 11 รายดังต่อไปนี้
            
            
            <br></br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            <b>3. จะต้องไม่เป็นผู้ที่ฆ่าเจ้ามรดก</b> ไม่ว่าด้วยเจตนาหรือประมาทอย่างร้ายแรง
            
            <br></br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            <b>4. จะต้องมีสภาพเป็นบุคคลขณะที่เจ้ามรดกถึงแก่ความตาย</b> ทายาทที่ถึงแก่ความตายก่อนหรือพร้อมกันกับเจ้ามรดกถึงแก่ความตาย ทายาทผู้นั้นจะไม่มีสิทธิรับมดกของเจ้ามรดก <mark className=" bg-[#fee9b2] rounded-xl">เว้นแต่ทายาทที่ป็นทารกในครรภ์มารดา ถึงแม้จะยังไม่มีสภาพเป็นบุคคลโดยสมบูรณ์</mark>{" "}
            
            <br></br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            <b>5. จะต้องไม่ถูกกันสิทธิ</b>ในการรับมรดกโดยผู้หนึ่งผู้ใด
          {/* <img
            src={img1}
            alt="มรดก"
            className="w-11/12 block ml-auto mr-auto"
          /> */}
        </p>
      </div>

      <div>
        <h1 className="ml-4">แนะนำสำหรับคุณ</h1>
        <ul className="list__post">
          <li>
            <a className="text-indigo-700 underline" href="/islam/1">
              ทายาทในกองมรดกสามารถเป็นใครได้บ้าง
            </a>
          </li>
        </ul>
      </div>
    </>
  );
};

export default ทายาทอิส;
