import React from "react";
import { Helmet } from "react-helmet";
// import img1 from "../../../assets/islam/img-title/กฎหมายมรดก.png";
import "./posts-islam.css"

const ทายาทอิส = () => {
  const TITLE = "กฎหมายมรดกอิสลาม";

  return (
    <>
      <Helmet>
        <title>{TITLE}</title>
      </Helmet>

      <div className="content">
        <br></br>
        <p>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>ทายาท</b> หมายถึง บุคคลที่มีสิทธิรับมรดกของผู้ตาย แต่ไม่รวมถึงผู้รับพินัยกรรม โดยผู้ที่เป็นทายาทของผู้ตายจะต้องมีคุณสมบัติที่ถูกกำหนดไว้
        </p>

        <div >
          <h2 className="initial-header">1. ทายาทที่มีสิทธิรับมรดก</h2>
          <p>
          &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
          ทายาทที่มีสิทธิรับมรดกในกฎหมายอิสลาม ถูกแบ่งออกเป็น 2 กลุ่ม คือ ทายาทฝ่ายชาย และทายาทฝ่ายหญิง โดยในแต่ละกลุ่มมีทายาทดังรายชื่อต่อไปนี้
          </p>
          <p className="ml-8">
            <ul className=" list-disc ml-16 mt-3">
              <li>
                <b>ทายาทฝ่ายชายที่มีสิทธิรับมรดกมี 15 คน</b>
                <ul className=" list-decimal ml-8 mb-3">
                  <li>
                    บุตรชาย
                  </li>
                  <li>
                    หลานชาย (บุตรของบุตรชาย)
                  </li>
                  <li>
                    บิดา
                  </li>
                  <li>
                    ปู่ที่ถูกต้องตามกฎหมายมรดก
                  </li>
                  <li>
                    พี่น้องชายร่วมบิดามารดา
                  </li>
                  <li>
                    พี่น้องชายร่ววมแต่บิดา
                  </li>
                  <li>
                    พี่น้องชายร่วมแต่มารดา
                  </li>
                  <li>
                    บุตรชายของพี่น้องร่วมบิดามารดา
                  </li>
                  <li>
                    บุตรชายของพี่น้องร่วมแต่บิดา
                  </li>
                  <li>
                    พี่น้องชายร่วมของบิดาที่ร่วมแต่มารดา
                  </li>
                  <li>
                    พี่น้องชายร่วมของบิดาที่ร่วมแต่บิดา
                  </li>
                  <li>
                    บุตรชายของพี่น้องชายของบิดาที่ร่วมบิดามารดา
                  </li>
                  <li>
                    บุตรชายของพี่น้องชายของบิดาที่ร่วมแต่มารดา
                  </li>
                  <li>
                    สามี
                  </li>
                  <li>
                    นายที่ปล่อยทาสให้เป็นไท
                  </li>
                </ul>
              </li>
              <li>
                <b>ทายาทฝ่ายหญิงที่มีสิทธิรับมรดกมี 10 คน</b>
                <ul className=" list-decimal ml-8 mb-3">
                  <li>
                    บุตรสาว
                  </li>
                  <li>
                    หลานสาว (บุตรสาวบุตรชาย)
                  </li>
                  <li>
                    มารดา
                  </li>
                  <li>
                    ยายที่ถูกต้องตามกฎหมายมรดก (มารดาของมารดา)
                  </li>
                  <li>
                    ย่าที่ถูกต้องตามกฎหมายมรดก (มารดาของบิดา)
                  </li>
                  <li>
                    พี่น้องสาวร่วมบิดามารดา
                  </li>
                  <li>
                    พี่น้องสาวร่วมแต่บิดา
                  </li>
                  <li>
                    พี่น้องสาวร่วมแต่มารดา
                  </li>
                  <li>
                    ภรรยา
                  </li>
                  <li>
                    นายหญิงที่ปล่อยทาส
                  </li>
                </ul>
              </li>
            </ul>

          </p>
        </div>

        {/* 1. คุณสมบัติของผู้ที่เป็นทายาท */}
        <div>
          <h2 id="second-header">2. คุณสมบัติของผู้ที่เป็นทายาท</h2>
          <p>
              &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
              ทายาทที่มีสิทธิรับมรดกจะต้องมีคุณสมบัติดังต่อไปนี้

              <ul className=" list-decimal ml-16 mt-3">
                <li>
                  <b>ต้องเป็นญาติหรือคู่สมรส</b> ที่ถูกต้องตามหลักกฎหมายอิสลามของผู้ตายเท่านั้น
                  <ul className=" list-disc ml-8 mb-3">
                    <li>
                      ญาติที่ไม่มีสิทธิได้รับมรดก -- เช่น การสมรสระหว่างบิดาและมารดาของบุตรไม่ถูกต้องตามหลักอิสลาม จะไม่ถือว่าบิดากับบุตรเป็นทายาทซึ่งกันและกัน
                    </li>
                    <li>
                    คู่สมรสที่ไม่มีสิทธิได้รับมรดก -- เช่น สามีกับภรรยาเมื่อปรากฏว่าการสมรสระหว่างทั้งสองนั้นไม่ถูกต้องตามหลักอิสลาม
                    </li>
                  </ul>                                        
                </li>

                <li>
                  <b>ต้องนับถืออิสลามเหมือนกับเจ้ามรดก</b> หากผู้ตาย (เจ้ามรดก) นับถืออิสลาม ทายาทที่มีสิทธิรับมรดกจำเป็นต้องนับถือศาสนาอิสลามเช่นเดียวกับเจ้ามรดก                                                                         
                </li>
              
                <li>
                <b>จะต้องไม่เป็นผู้ที่ฆ่าเจ้ามรดก</b> ไม่ว่าด้วยเจตนาหรือประมาทอย่างร้ายแรง
                </li>
              
                <li>
                  <b>จะต้องมีสภาพเป็นบุคคลขณะที่เจ้ามรดกถึงแก่ความตาย</b> ทายาทที่ถึงแก่ความตายก่อนหรือพร้อมกันกับเจ้ามรดกถึงแก่ความตาย ทายาทผู้นั้นจะไม่มีสิทธิรับมดกของเจ้ามรดก <mark className=" bg-[#fee9b2] rounded-xl">เว้นแต่ทายาทที่ป็นทารกในครรภ์มารดา ถึงแม้จะยังไม่มีสภาพเป็นบุคคลโดยสมบูรณ์</mark>{" "}
                </li>
                
                <li>
                  <b>จะต้องไม่ถูกกันสิทธิ</b>ในการรับมรดกโดยผู้หนึ่งผู้ใด
                </li>
              </ul>
          </p>
        </div>

        <div>
          {/* 2. ประเภทของทายาท */}
          <h2 id="third-header">3. ประเภทของทายาท</h2>
          <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            อาริฟ คอลีล อาบูอีด ได้แบ่งทายาทที่มีสิทธิได้รับมรดกออกเป็น 4 ประเภทคือ
            <h3 className="fourth-header">2.1 อัศฮาบุลฟุรูฎ (الصحاب الفروض)</h3> 
              <p className="ml-8">  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;หมายถึง ทายาทที่ได้ถูกกำหนดสัดส่วนของสิทธิอย่างชัดเจนในอัลกรุอ่าน อัสสุนนะฮฺ หรือ อิจญ์มาอฺ โดยทายาทประเภทอัศฮาบุลฟุรูฎ (الصحاب الفروض) ถูกกแบ่งออกเป็น 2 กลุ่ม ดังนี้
                <ul className=" list-disc ml-16 mt-3">          
                      <li>
                        <b>อัศฮาบุลฟูรูฎ อันนะสะบียะห์ (اصحاب الفروض النسبية) </b> คือ กลุ่มทายาทที่มีสิทธิในการรับมรดกแบบอัตราส่วนที่ถูกกำหนดส่วนที่กำหนดไว้ในอัลกุรอ่าน อัสสุนนะฮฺ หรือ อิจญ์มาอฺ
                        <mark className=" bg-[#fee9b2] rounded-xl">เนื่องจากมีความใกล้ชิดทางสายเลือดกับผู้ตาย (เจ้ามรดก)</mark>{" "}
                        <p className="ml-8">-- เช่น บิดามาราดาของผู้ตาย บุตรสาวของผู้ตาย หรืออาจเป็นพี่หรือน้องหญิงร่วมบิดามารดากับผู้ตาย เป็นต้น</p>
                      </li>
                      <li>
                      <b>อัศฮาบุลฟูรูฎ อัสสะบาบียะห์ (اصحاب الفروض السببية) </b> คือ กลุ่มทายาทที่มีสิทธิในการรับมรดก <mark className=" bg-[#fee9b2] rounded-xl">เนื่องจากมีการสมรสระหว่างกัน หรือก็คือสามีภรรยา</mark>{" "} ซึ่งถูกกำหนดไว้ในอัลกุรอ่าน อัสสุนนะฮฺ หรือ อิจญ์มาอฺ
                      </li>   
                </ul>
                <br></br> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
                ซึ่งทายาทประเภทที่ 1. อัศฮาบุลฟุรูฎ (الصحاب الفروض) เป็นทายาทประเภทที่มีสิทธิรับส่วนกำหนดตามที่กำหนดไว้ <mark className=" bg-[#fee9b2] rounded-xl">ถูกแบ่งออกเป็น 11 รายดังต่อไปนี้</mark>{" "}
              </p>
          </p>
            <div>
              <p className="ml-8">  
                {/* ลำดับที่ 2.1.1. สามี*/}
                <h4 className="fifth-header">2.1.1. สามี</h4>
                <p className="ml-16"> มีสิทธิรับมรดก 2 สภาพด้วยกัน ดังตารางต่อไปนี้</p>
                <table className=" w-full mt-3">
                  
                  {/* หัวข้อ */}
                  <tr>
                    <th>สภาพ</th>
                    <th>เงื่อนไข</th>
                    <th>คำอธิบาย</th>
                  </tr>

                  <tr>
                    <td>
                      1
                    </td>
                    <td>
                      <a>
                        ได้รับ 1/2 ของกองมรดก หากเจ้ามรดก (ผู้ตาย) ไม่มีผู้สืบสันดานสายชาย
                      </a> 
                    </td>
                    <td>
                      <a>
                      สามีจะได้รับมรดก 1/2 ของกองมรดก หากผู้ตายที่เป็นภรรยาไม่มีบุตร ไ่ม่ว่าจะเป็นบุตรชาย หรือบุตรสาว
                      และไม่มีหลานชาย หรือหลานหญิง (ต้องเป็นหลานหญิงที่เกิดจากบุตรชายเท่านั้น) โดยไม่คำนึงว่าจะเป็นบุตรที่เกิดจากสามีปัจจุบัน หรือสามีอื่น 
                      และแม้แต่จะเป็นบุตรนอกสมรส (บุตรซีนา)
                      </a>
                    </td>
                  </tr> {/*จบลำดับที่ 1 */}

                  {/* ลำดับที่ 2*/}
                  <tr>
                    <td>
                      2
                    </td>
                    <td>
                      <a>
                        ได้รับ 1/4 ของกองมรดก หากเจ้ามรดก (ผู้ตาย) มีผู้สืบสันดานสายชาย
                      </a> 
                    </td>
                    <td>
                      <a>
                      สามีมีสิทธิที่จะได้รับมรดก 1/4 ของกองมรดก หากผู้ตายที่เป็นภรรยามีผู้สืบสันดาน โดยไม่คำนึงถึงว่าจะเป็นบุตรที่เกิดจากสามีปัจจุบันหรือจากอดีตสามี 
                      และไม่คำนึงว่าบุตร หรือหลานจะเป็นเพศชาย หรือเพศหญิง
                      </a>
                    </td>
                  </tr> {/*จบลำดับที่ 2.1.1. สามี*/}
                 </table> {/*สิ้นสุดตาราง */}
                </p>
              <p className="ml-8">
                <br></br><br></br>

                <h4 className="sixth-header">2.1.2. ภรรยา</h4> 
                  <p className="ml-16"> มีสิทธิรับมรดก 2 สภาพด้วยกัน ดังตารางต่อไปนี้</p>
                <table className=" w-full mt-3">
                  
                  {/* หัวข้อ */}
                  <tr>
                    <th>สภาพ</th>
                    <th>เงื่อนไข</th>
                    <th>คำอธิบาย</th>
                  </tr>

                  {/* ลำดับที่ 2.1.1. ภรรยา*/}
                  <tr>
                    <td>
                      1
                    </td>
                    <td>
                      <a>
                        ได้รับ 1/4 ของกองมรดก หากเจ้ามรดก (ผู้ตาย) ไม่มีผู้สืบสันดานสายชาย
                      </a> 
                    </td>
                    <td>
                      <a>
                        ภรรยาหนึ่งคนหรือหลายคนจะได้รับจะได้รับมรดก 1/4 เมื่อสามีหรือผู้ตายไม่มีบุตร หรือหลานที่เกิดจากบุตรชาย ไม่ว่าจะเป็นบุตรที่เกิดจากภรรยาปัจจุบัน 
                        หรือเกิดจากอดีตภรรยาก็ตาม และไม่คำนึงว่าบุตรหรือหลานนั้นจะเป็นหญิง หรือชาย
                      </a>
                    </td>
                  </tr> {/*จบลำดับที่ 1 */}

                  {/* ลำดับที่ 2*/}
                  <tr>
                    <td>
                      2
                    </td>
                    <td>
                      <a>
                      ได้รับ 1/8 ของกองมรดก หากเจ้ามรดก (ผู้ตาย) มีบุตร หรือผู้สืบสันดานสายชาย
                      </a> 
                    </td>
                    <td>
                      <a>
                        ภรรยาของผู้ตายมีสิทธิได้รับมรดก 1/8 โดยมีเงื่อนไขว่าหากสามีที่เป็นผู้ตายมีบุตรหรือหลาน โดยไม่คำนึงว่าจะเกิดจากภรรยาคนปัจจุบัน หรือเกิดจากภรรยาคนอื่น ๆ ของสามี
                        และไม่คำนึงว่าบุตร หรือหลานนั้นจะเป็นเพศชาย หรือเพศหญิง
                      </a>
                    </td>
                  </tr> {/*จบลำดับที่ 2.1.1. ภรรยา*/}
                 </table> {/*สิ้นสุดตาราง */}

                </p>
              <p className="ml-8">
                {/* ลำดับที่ 2.1.2. บิดา*/}
                <br></br><br></br>
                <h4 className="seventh-header">2.1.3. บิดา</h4>
                  <p className="ml-16"> มีสิทธิรับมรดก 3 สภาพด้วยกัน ดังตารางต่อไปนี้</p>
                <table className=" w-full mt-3">
                  
                  {/* หัวข้อ */}
                  <tr>
                    <th>สภาพ</th>
                    <th>เงื่อนไข</th>
                    <th>คำอธิบาย</th>
                  </tr> {/* จบหัวข้อ */}

                  {/* ลำดับที่ 1*/}
                  <tr>
                    <td>
                      1
                    </td>
                    <td>
                      <a>
                        ได้รับ 1/6 ของกองมรดก หากเจ้ามรดก (ผู้ตาย) มีบุตรชาย หรือผู้สืบสันดานสายชายที่เป็นเพศชาย
                      </a> 
                    </td>
                    <td>
                      <a>
                        บิดาของผู้ตาย (บุตรชาย หรือบุตรสาว) จะได้รับมรดกของผู้ตาย 1/6 โดยมีเงื่อนไขว่าหากผู้ตายมีบุตรชาย หรือผู้สืบสันดานสายชายที่เป็นเพศชาย (หลานชาย, เหลนชาย ฯลฯ)
                      </a>
                    </td>
                  </tr> {/*จบลำดับที่ 1 */}

                  {/* ลำดับที่ 2*/}
                  <tr>
                    <td>
                      2
                    </td>
                    <td>
                      <a>
                      ได้รับ 1/6 ของกองมรดก และส่วนเหลือ หากเจ้ามรดก (ผู้ตาย) มีบุตรสาว หรือผู้สืบสันดานสายชายที่เป็นเพศหญิง
                      </a> 
                    </td>
                    <td>
                      <a>
                      บิดาของผู้ตาย (บุตรชาย หรือบุตรสาว) จะได้รับมรดกของผู้ตาย 1/6 และส่วนเหลือ โดยมีเงื่อนไขว่าหากผู้ตายมีบุตรสาว หรือผู้สืบสันดานสายชายที่เป็นเพศหญิง (หลานสาว, เหลนสาว)
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 2*/}

                  {/* ลำดับที่ 2*/}
                  <tr>
                    <td>
                      3
                    </td>
                    <td>
                      <a>
                      ได้รับส่วนเหลือ หากเจ้ามรดก (ผู้ตาย) ไม่มีผู้สืบสันดานสายชาย
                      </a> 
                    </td>
                    <td>
                      <a>
                        บิดาของผู้ตาย (บุตรชาย หรือบุตรสาว) จะได้รับส่วนเหลือ โดยมีเงื่อนไขว่าหากผู้ตายไม่มีบุตร ไม่ว่าจะเป็นชาย 
                        หรือหญิง, หลานชาย หรือหลานสาวอันเกิดจากบุตรชายของผู้ตาย 
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 2*/}
                 </table> {/*สิ้นสุดตาราง */} {/*จบลำดับที่ 2.1.1. บิดา*/}
                </p>

              <p className="ml-8">
                {/* ลำดับที่ 2.1.3. มารดา*/}
                <br></br><br></br>
                <h4 className="eigth-header">2.1.4. มารดา</h4>
                  <p className="ml-16"> มีสิทธิรับมรดก 3 สภาพด้วยกัน ดังตารางต่อไปนี้</p>
                <table className=" w-full mt-3">
                  
                  {/* หัวข้อ */}
                  <tr>
                    <th>สภาพ</th>
                    <th>เงื่อนไข</th>
                    <th>คำอธิบาย</th>
                  </tr> {/* จบหัวข้อ */}

                  {/* ลำดับที่ 1*/}
                  <tr>
                    <td>
                      1
                    </td>
                    <td>
                      <a>
                        ได้รับ 1/6 ของกองมรดก หากเจ้ามรดก (ผู้ตาย) มีผู้สืบสันดานสายชายหรือมีพี่น้องหลายคน
                      </a> 
                    </td>
                    <td>
                      <a>
                        มารดาของผู้ตาย (บุตรชาย หรือบุตรสาว) จะได้รับมรดกของผู้ตาย 1/6 เมื่อผู้ตายมีบุตร หรือมีหลาน (บุตรของบุตรชายของผู้ตาย)
                        หรือมีทายาทที่มาจากสายชาย หรือผู้ตายมีพี่น้องตั้งแต่ 2 คนขึ้นไป (พี่น้องชาย หรือหญิง) จะร่วมบิดามราดา หรือร่วมแต่บิดา หรือร่วมแต่มารดาก็ตาม
                      </a>
                    </td>
                  </tr> {/*จบลำดับที่ 1 */}

                  {/* ลำดับที่ 2*/}
                  <tr>
                    <td>
                      2
                    </td>
                    <td>
                      <a>
                      ได้รับ 1/3 ของกองมรดก
                      </a> 
                    </td>
                    <td>
                      <a>
                      มารดาของผู้ตาย (บุตรชาย หรือบุตรสาว) จะได้รับมรดกของผู้ตาย 1/3 ถ้าหากผู้ตายไม่มีบุตร, ผู้สืบสันดานสายชาย, ไม่มีพี่น้อง (หญิง หรือชาย) หรือมีแต่ต้องไม่เกิน 1 คน
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 2*/}

                  {/* ลำดับที่ 2*/}
                  <tr>
                    <td>
                      3
                    </td>
                    <td>
                      <a>
                      ได้รับ 1/3 จากส่วนที่เหลือ
                      </a> 
                    </td>
                    <td>
                      <a>
                        มารดาของผู้ตาย (บุตรชาย หรือบุตรสาว) จะได้รับมรดกของผู้ตาย 1/3 จากส่วนที่เหลือ ในกรณีที่ผู้ตาย (บุตรสาว) มีแต่สามีและบิดา หรือผู้ตาย (บุตรชาย) มีภรรยาและบิดาร่วมอยู่ด้วย
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 2*/}
                 </table> {/*สิ้นสุดตาราง */} {/*จบลำดับที่ 2.1.4 มารดา*/}
                </p>

              <p className="ml-8">
                {/* ลำดับที่ 2.1.5.ปู่*/}
                <br></br><br></br>
                <h4 className="ninth-header">2.1.5. ปู่</h4>
                  <p className="ml-16"> มีสิทธิรับมรดก 6 สภาพด้วยกัน ดังตารางต่อไปนี้</p>
                <table className=" w-full mt-3">
                  
                  {/* หัวข้อ */}
                  <tr>
                    <th>สภาพ</th>
                    <th>เงื่อนไข</th>
                    <th>คำอธิบาย</th>
                  </tr> {/* จบหัวข้อ */}

                  {/* ลำดับที่ 1*/}
                  <tr>
                    <td>
                      1
                    </td>
                    <td>
                      <a>
                        ถูกกันสิทธิ หากเจ้ามรดก (ผู้ตาย) มีบิดา
                      </a> 
                    </td>
                    <td>
                      <a>
                        ปู่ของผู้ตายจะไม่มีสิทธิรับมรดก ถ้ามีบิดาของของผู้ตายร่วมอยู่ด้วย
                      </a>
                    </td>
                  </tr> {/*จบลำดับที่ 1 */}

                  {/* ลำดับที่ 2*/}
                  <tr>
                    <td>
                      2
                    </td>
                    <td>
                      <a>
                      ได้รับ 1/6 ของกองมรดกหากเจ้ามรดก (ผู้ตาย) มีบุตรชาย หรือผู้สืบสันดานสายชายที่เป็นเพศชาย
                      </a> 
                    </td>
                    <td>
                      <a>
                        ปู่ของผู้ตาย จะได้รับมรดกของผู้ตาย 1/6 ในกรณีที่ผู้ตายมีบุตรชาย หรือผู้สืบสันดานสายชายที่เป็นเพศชาย (บุตรชาย หรือหลานชายอันเกิดจากผู้ตายที่เป็นบุตรชาย เช่น หลานชาย, เหลนชาย)
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 2*/}

                  {/* ลำดับที่ 3*/}
                  <tr>
                    <td>
                      3
                    </td>
                    <td>
                      <a>
                      ได้รับ 1/6 และส่วนที่เหลือ หากเจ้ามรดก (ผู้ตาย) มีบุตรสาว หรือผู้สืบสันดานสายชายที่เป็นเพศหญิง
                      </a> 
                    </td>
                    <td>
                      <a>
                      ปู่ของผู้ตาย จะได้รับมรดกของผู้ตาย 1/6 และส่วนที่เหลือในกรณีที่ผู้ตายมีบุตรสาว หรือผู้สืบสันดานสายชายที่เป็นเพศหญิง (บุตรสาว หรือหลานสาวอันเกิดจากผู้ตายที่เป็นบุตรชาย เช่น หลานสาว, เหลนสาว)
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 3*/}

                  {/* ลำดับที่ 4*/}
                  <tr>
                    <td>
                      4
                    </td>
                    <td>
                      <a>
                      ได้รับส่วนที่เหลือ หากเจ้ามรดก (ผู้ตาย) หากเจ้ามรดกไม่มีผู้สืบสันดานสายชาย
                      </a> 
                    </td>
                    <td>
                      <a>
                      ปู่ของผู้ตายจะได้รับมรดกเป็นส่วเหลือ ในกรณีที่ผู้ตายไม่มีบุตรชาย หรือบุตรสาว หรือหลานชาย หรือหลานสาวอันเกิดจากบุตรชายของผู้ตาย
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 4*/}
                 </table> {/*สิ้นสุดตาราง */} {/*จบลำดับที่ 2.1.5 ปู่*/}
                </p>
              <p className="ml-8">
              {/* ลำดับที่ 2.1.6. ย่า, ยาย*/}
                <br></br><br></br>
                <h4 className="tenth-header">2.1.6. ย่า และยาย</h4>
                  <p className="ml-16"> มีสิทธิรับมรดก 2 สภาพด้วยกัน ดังตารางต่อไปนี้</p>
                <table className=" w-full mt-3">
                  
                  {/* หัวข้อ */}
                  <tr>
                    <th>สภาพ</th>
                    <th>เงื่อนไข</th>
                    <th>คำอธิบาย</th>
                  </tr> {/* จบหัวข้อ */}

                  {/* ลำดับที่ 1*/}
                  <tr>
                    <td>
                      1
                    </td>
                    <td>
                      <a>
                        ถูกกันสิทธิ หากเจ้ามรดก (ผู้ตาย) มีบิดามารดา
                      </a> 
                    </td>
                    <td>
                      <a>
                        -ยายของผู้ตายจะถูกกันสิทธิในกรณีที่ผู้ตายมีมารดา 
                        <br></br>
                        -ย่าของผู้ตายจะถูกกันสิทธิในกรณีที่ผู้ตายมีบิดา
                      </a>
                    </td>
                  </tr> {/*จบลำดับที่ 1 */}

                  {/* ลำดับที่ 2*/}
                  <tr>
                    <td>
                      2
                    </td>
                    <td>
                      <a>
                      ได้รับ 1/6 ของกองมรดก 
                      </a> 
                    </td>
                    <td>
                      <a>
                      ย่าและยาย จะได้รับ 1/6 ของกองมรดกหากไม่มีผู้กันสิทธิดังที่ได้กล่าวในสภาพที่ 1
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 2*/}
                 </table> {/*สิ้นสุดตาราง */} {/*จบลำดับที่ 2.1.6 ย่า, ยาย*/}
                </p>

              <p className="ml-8">
              {/* ลำดับที่ 2.1.7. บุตรสาว*/}
              <br></br><br></br>
                <h4 className="eleventh-header">2.1.7. บุตรสาว</h4>
                  <p className="ml-16"> มีสิทธิรับมรดก 3 สภาพด้วยกัน ดังตารางต่อไปนี้</p>
                <table className=" w-full mt-3">
                  
                  {/* หัวข้อ */}
                  <tr>
                    <th>สภาพ</th>
                    <th>เงื่อนไข</th>
                    <th>คำอธิบาย</th>
                  </tr> {/* จบหัวข้อ */}

                  {/* ลำดับที่ 1*/}
                  <tr>
                    <td>
                      1
                    </td>
                    <td>
                      <a>
                        ได้รับ 1/2 ของกองมรดกหากว่ามีบุตรสาวเพียงคนเดียว และไม่มีบุตรชาย
                      </a> 
                    </td>
                    <td>
                      <a>
                        บุตรสาวของผู้ตายจะได้รับ 1/2 ของกองมรดก ในกรณีที่ผู้ตายมีบุตรสาวเพียงคนเดียว และผู้ตายไม่มีบุตรชาย 
                      </a>
                    </td>
                  </tr> {/*จบลำดับที่ 1 */}

                  {/* ลำดับที่ 2*/}
                  <tr>
                    <td>
                      2
                    </td>
                    <td>
                      <a>
                      ได้รับ 2/3 ของกองมรดกหากเจ้ามรดก (ผู้ตาย) มีบุตรสาวหลายคน
                      </a> 
                    </td>
                    <td>
                      <a>
                        บุตรสาวของผู้ตาย จะได้รับ 2/3 ของกองมรดกในกรณีที่ผู้ตายมีบุตรสาว (พี่สาวหรือน้องสาวของบุตรสาว) ตั้งแต่ 2 คนขึ้นไป โดยจะต้องไม่มีบุตรชาย (พี่ชายหรือน้องชายของบุตรสาว) ร่วมอยู่ด้วย
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 2*/}

                  
                  {/* ลำดับที่ 3*/}
                  <tr>
                    <td>
                      3
                    </td>
                    <td>
                      <a>
                        ร่วมกันรับส่วนที่เหลือกับบุตรชาย หากเจ้ามรดก (ผู้ตาย) มีบุตรชายร่วมอยู่ด้วย
                      </a> 
                    </td>
                    <td>
                      <a>
                        บุตรสาวของผู้ตายจะได้รับส่วนที่เหลือ ในกรณีที่ผู้ตายมีบุตรชาย (พี่ชายหรือน้องชายของบุตรสาว) ร่วมอยู่ด้วย โดยให้แบ่งให้บุตรชาย 2 ส่วน บุตรสาว 1 ส่วน
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 3*/}
                 </table> {/*สิ้นสุดตาราง */} {/*จบลำดับที่ 2.1.7. บุตรสาว*/}
                </p>

              <p className="ml-8">
               {/* ลำดับที่ 2.1.8. หลานสาว*/}
                <br></br><br></br>
                <h4 className="twelfth-header">2.1.8. หลานสาว <mark className=" bg-[#fee9b2] rounded-xl">(อันเกิดจากบุตรชายของผู้ตาย){" "}</mark> </h4>
                  <p className="ml-16"> มีสิทธิรับมรดก 5 สภาพด้วยกัน ดังตารางต่อไปนี้</p>
                <table className=" w-full mt-3">
                  
                  {/* หัวข้อ */}
                  <tr>
                    <th>สภาพ</th>
                    <th>เงื่อนไข</th>
                    <th>คำอธิบาย</th>
                  </tr> {/* จบหัวข้อ */}

                  {/* ลำดับที่ 1*/}
                  <tr>
                    <td>
                      1
                    </td>
                    <td>
                      <a>
                        ถูกกันสิทธิ
                      </a> 
                    </td>
                    <td>
                      <a>
                        หลานสาวจะถูกกันสิทธิ หากผู้ตายมีบุตรชาย หรือมีบุตรสาวตั้งแต่ 2 คนขึ้นไป และผู้ตายไม่มีผู้สืบสันดานสายชายที่เป็นเพศชาย 
                        ที่ได้รับส่วนที่เหลือร่วมกับนางในกรณีที่หลานสาวอันเกิดจากบุตรชายได้รับครึ่งหนึ่งจากกองมรดกนั้น
                      </a>
                    </td>
                  </tr> {/*จบลำดับที่ 1 */}

                  {/* ลำดับที่ 2*/}
                  <tr>
                    <td>
                      2
                    </td>
                    <td>
                      <a>
                        ได้รับ 1/2 ของกองมรดกหากเจ้ามรดก (ผู้ตาย) มีหลานสาวเพียงคนเดียว
                      </a> 
                    </td>
                    <td>
                      <a>
                        หลานสาวของผู้ตาย จะได้รับมรดกของผู้ตาย 1/2 ในกรณีที่ผู้ตายมีหลานสาวเพียงคนเดียว 
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 2*/}
                  
                  {/* ลำดับที่ 3*/}
                  <tr>
                    <td>
                      3
                    </td>
                    <td>
                      <a>
                        ได้รับ 2/3 ของกองมรดกหากเจ้ามรดก (ผู้ตาย) มีหลานสาวหลายคน
                      </a> 
                    </td>
                    <td>
                      <a>
                        หลานสาวของผู้ตาย จะได้รับมรดกของผู้ตาย 2/3 ในกรณีที่ผู้ตายมีหลานสาวหลายคน
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 3*/}

                  {/* ลำดับที่ 4*/}
                  <tr>
                    <td>
                      4
                    </td>
                    <td>
                      <a>
                        ได้รับ 1/6 ของกองมรดกหากเจ้ามรดก (ผู้ตาย) มีบุตรสาวร่วมอยู่ด้วย 1 คน
                      </a> 
                    </td>
                    <td>
                      <a>
                        หลานสาวของผู้ตาย จะได้รับมรดกของผู้ตาย 1/6 ในกรณีที่ผู้ตายมีบุตรสาวร่วมอยู่ด้วย 1 คน 
                        และไม่มีผู้สืบสันดานสายชายที่เป็นเพศชายที่อยู่ระดับเดียวกัน โดยบุตรสาวของผู้ตายได้ครึ่งหนึ่งตามอัตราส่วนที่ถูกกำหนด 
                        และหลานสาวนั้นได้ 1/6 
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 4*/}

                  {/* ลำดับที่ 5*/}
                  <tr>
                    <td>
                      5
                    </td>
                    <td>
                      <a>
                        ได้รับส่วนที่เหลือ
                      </a> 
                    </td>
                    <td>
                      <a>
                        หลานสาวของผู้ตาย จะได้รับส่วนที่เหลือของกองมรดก ในกรณีที่มีพี่ชาย หรือน้องชาย หรือลูกพี่น้องชายร่วมอยู่ด้วย
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 5*/}
                 </table> {/*สิ้นสุดตาราง */} {/*จบลำดับที่ 2.1.8. หลานสาว*/}
                </p>

              <p className="ml-8">
               {/* ลำดับที่ 2.1.9. พี่สาวหรือน้องสาวร่วมบิดามารดา*/}
               <br></br><br></br>
                <h4 className="thirteenth-header">2.1.9. พี่สาว หรือน้องสาว<mark className=" bg-[#fee9b2] rounded-xl">ร่วมบิดามารดา{" "}</mark> </h4>
                  <p className="ml-16"> มีสิทธิรับมรดก 5 สภาพด้วยกัน ดังตารางต่อไปนี้</p>
                <table className=" w-full mt-3">
                  
                  {/* หัวข้อ */}
                  <tr>
                    <th>สภาพ</th>
                    <th>เงื่อนไข</th>
                    <th>คำอธิบาย</th>
                  </tr> {/* จบหัวข้อ */}

                  {/* ลำดับที่ 1*/}
                  <tr>
                    <td>
                      1
                    </td>
                    <td>
                      <a>
                        ถูกกันสิทธิ
                      </a> 
                    </td>
                    <td>
                      <a>
                        ถูกกันสิทธิโดย
                        <br></br>-บุตรชาย 
                        <br></br>-ผู้สืบสันดานสายชายที่เป็นเพศชาย 
                        <br></br>-บิดา
                      </a>
                    </td>
                  </tr> {/*จบลำดับที่ 1 */}

                  {/* ลำดับที่ 2*/}
                  <tr>
                    <td>
                      2
                    </td>
                    <td>
                      <a>
                        ได้รับ 1/2 ของกองมรดกหากเจ้ามรดก (ผู้ตาย) มีพี่สาว หรือน้องสาวเพียงคนเดียว
                      </a> 
                    </td>
                    <td>
                      <a>
                        พี่สาวหรือน้องสาวของผู้ตาย จะได้รับมรดกของผู้ตาย 1/2 ในกรณีที่ผู้ตายมีพี่น้องที่เป็นเพศหญิงเพียงคนเดียว
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 2*/}
                  
                  {/* ลำดับที่ 3*/}
                  <tr>
                    <td>
                      3
                    </td>
                    <td>
                      <a>
                        ได้รับ 2/3 ของกองมรดกหากเจ้ามรดก (ผู้ตาย) มีพี่สาว หรือน้องสาวหลายคน
                      </a> 
                    </td>
                    <td>
                      <a>
                      พี่สาวหรือน้องสาวของผู้ตาย จะได้รับมรดกของผู้ตาย 2/3 ในกรณีที่ผู้ตายมีพี่น้องที่เป็นเพศหญิงหลายคนร่วมอยู่ด้วย
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 3*/}

                  {/* ลำดับที่ 4*/}
                  <tr>
                    <td>
                      4
                    </td>
                    <td>
                      <a>
                        ร่วมกันรับส่วนที่เหลือกับพี่ชาย หรือน้องชายร่วมบิดามารดา
                      </a> 
                    </td>
                    <td>
                      <a>
                        พี่สาวหรือน้องสาวของผู้ตาย จะได้รับมรดกของผู้ตายเป็นส่วนเหลือ ร่วมกับพี่ชาย หรือน้องชายร่วมบิดามารดาเดียวกัน 
                        โดยแบ่งให้ฝ่ายชาย 2 ส่วนต่อฝ่ายหญิง 1 ส่วน
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 4*/}

                  {/* ลำดับที่ 5*/}
                  <tr>
                    <td>
                      5
                    </td>
                    <td>
                      <a>
                        ได้รับส่วนที่เหลือ
                      </a> 
                    </td>
                    <td>
                      <a>
                        พี่สาวหรือน้องสาวของผู้ตาย จะได้รับมรดกของผู้ตายเป็นส่วนเหลือ ถ้าผู้ตายมีบุตรหญิง หรือผู้สืบสันดานสายชายที่เป็นเพศหญิง
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 5*/}
                 </table> {/*สิ้นสุดตาราง */} {/*จบลำดับที่ 2.1.9. พี่สาว หรือน้องสาว*/}
                </p>

              <p className="ml-8">
               {/* ลำดับที่ 2.1.10. พี่สาว หรือน้องสาวร่วมแต่บิดา*/}
               <br></br><br></br>
                <h4 className="fourteenth-header">2.1.10. พี่สาว หรือน้องสาว<mark className=" bg-[#fee9b2] rounded-xl">ร่วมแต่บิดา{" "}</mark> </h4>
                  <p className="ml-16"> มีสิทธิรับมรดก 6 สภาพด้วยกัน ดังตารางต่อไปนี้</p>
                <table className=" w-full mt-3">
                  
                  {/* หัวข้อ */}
                  <tr>
                    <th>สภาพ</th>
                    <th>เงื่อนไข</th>
                    <th>คำอธิบาย</th>
                  </tr> {/* จบหัวข้อ */}

                  {/* ลำดับที่ 1*/}
                  <tr>
                    <td>
                      1
                    </td>
                    <td>
                      <a>
                        ถูกกันสิทธิ
                      </a> 
                    </td>
                    <td>
                      <a>
                        ถูกกันสิทธิโดย
                        <br></br>-บิดา 
                        <br></br>-บุตรชาย หรือผู้สืบสันดานสายชายที่เป็นเพศชาย
                        <br></br>-พี่น้องชายร่วมบิดามารดา
                        <br></br>-พี่สาว หรือน้องสาวร่วมบิดามารดาของผู้ตาย 2 คนขึ้นไป แต่ถ้ามีพี่ชายร่วมอยู่ด้วย ก็ได้รับส่วนเหลือ
                        <br></br>-พี่สาว หรือน้องสาวร่วมบิดามารดาของผู้ตายที่อยู่ในสภาพที่รับส่วนเหลือ
                      </a>
                    </td>
                  </tr> {/*จบลำดับที่ 1 */}

                  {/* ลำดับที่ 2*/}
                  <tr>
                    <td>
                      2
                    </td>
                    <td>
                      <a>
                        ได้รับ 1/2 ของกองมรดกหากเจ้ามรดก (ผู้ตาย) มีพี่สาว หรือน้องสาวเพียงคนเดียว
                      </a> 
                    </td>
                    <td>
                      <a>
                        พี่สาวหรือน้องสาวของผู้ตาย จะได้รับมรดกของผู้ตาย 1/2 ในกรณีที่ผู้ตายมีพี่น้องที่เป็นเพศหญิงเพียงคนเดียว
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 2*/}
                  
                  {/* ลำดับที่ 3*/}
                  <tr>
                    <td>
                      3
                    </td>
                    <td>
                      <a>
                        ได้รับ 2/3 ของกองมรดกหากเจ้ามรดก (ผู้ตาย) มีพี่สาว หรือน้องสาวหลายคน
                      </a> 
                    </td>
                    <td>
                      <a>
                      พี่สาวหรือน้องสาวของผู้ตาย จะได้รับมรดกของผู้ตาย 2/3 ในกรณีที่ผู้ตายมีพี่น้องที่เป็นเพศหญิงหลายคนร่วมอยู่ด้วย
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 3*/}

                  {/* ลำดับที่ 4*/}
                  <tr>
                    <td>
                      4
                    </td>
                    <td>
                      <a>
                        ได้รับ 1/6 ของกองมรดกหากเจ้ามรดก (ผู้ตาย) มีพี่สาว หรือน้องสาวร่วมบิดามารดา 1 คน
                      </a> 
                    </td>
                    <td>
                      <a>
                        พี่สาวหรือน้องสาวของผู้ตาย จะได้รับมรดกของผู้ตาย 1/6 ในกรณีที่ผู้ตายมีพี่สาว หรือน้องสาวร่วมบิดามารดา
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 4*/}                  

                  {/* ลำดับที่ 5*/}
                  <tr>
                    <td>
                      5
                    </td>
                    <td>
                      <a>
                        ร่วมกันรับส่วนที่เหลือกับพี่ชาย หรือน้องชายร่วมแต่บิดา
                      </a> 
                    </td>
                    <td>
                      <a>
                        พี่สาวหรือน้องสาวของผู้ตาย จะได้รับมรดกของผู้ตายเป็นส่วนเหลือ ร่วมกับพี่ชาย หรือน้องชายร่วมแต่บิดาเดียวกัน 
                        โดยแบ่งให้ฝ่ายชาย 2 ส่วนต่อฝ่ายหญิง 1 ส่วน
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 5*/}

                  {/* ลำดับที่ 6*/}
                  <tr>
                    <td>
                      5
                    </td>
                    <td>
                      <a>
                        ได้รับส่วนที่เหลือ
                      </a> 
                    </td>
                    <td>
                      <a>
                        พี่สาวหรือน้องสาวของผู้ตาย จะได้รับมรดกของผู้ตายเป็นส่วนเหลือ ถ้าผู้ตายมีบุตรหญิง หรือผู้สืบสันดานสายชายที่เป็นเพศหญิง
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 6*/}
                 </table> {/*สิ้นสุดตาราง */} {/*จบลำดับที่ 2.1.10. พี่สาว หรือน้องสาวร่วมแต่บิดา*/}
                </p>

              <p className="ml-8">
               {/* ลำดับที่ 2.1.11. พี่ หรือน้องร่วมแต่มารดา*/}
               <br></br><br></br>
                <h4 className="fifteenth-header">2.1.11. พี่ หรือน้อง<mark className=" bg-[#fee9b2] rounded-xl">ร่วมแต่มารดา{" "}</mark> </h4>
                  <p className="ml-16"> มีสิทธิรับมรดก 4 สภาพด้วยกัน ดังตารางต่อไปนี้</p>
                <table className=" w-full mt-3">
                  
                  {/* หัวข้อ */}
                  <tr>
                    <th>สภาพ</th>
                    <th>เงื่อนไข</th>
                    <th>คำอธิบาย</th>
                  </tr> {/* จบหัวข้อ */}

                  {/* ลำดับที่ 1*/}
                  <tr>
                    <td>
                      1
                    </td>
                    <td>
                      <a>
                        ถูกกันสิทธิ
                      </a> 
                    </td>
                    <td>
                      <a>
                        ถูกกันสิทธิโดย 
                        <br></br>-บุตรชาย หรือผู้สืบสันดานสายชาย
                        <br></br>-บิดา หรือปู่ หรือผู้ที่อยู่ในลำดับที่สูงขึ้นไปจนสุดสาย
                      </a>
                    </td>
                  </tr> {/*จบลำดับที่ 1 */}

                  {/* ลำดับที่ 2*/}
                  <tr>
                    <td>
                      2
                    </td>
                    <td>
                      <a>
                        ได้รับ 1/6 ของกองมรดกหากเจ้ามรดก (ผู้ตาย) มีพี่ หรือน้องเพียง (ไม่ว่าจะเป็นชาย หรือหญิง) คนเดียว
                      </a> 
                    </td>
                    <td>
                      <a>
                        พี่หรือน้อง (ไม่ว่าจะเป็นชาย หรือหญิง) ของผู้ตาย จะได้รับมรดกของผู้ตาย 1/6 ในกรณีที่ผู้ตายมีพี่น้องไม่ว่าชาย หรือหญิงเพียงคนเดียว
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 2*/}
                  
                  {/* ลำดับที่ 3*/}
                  <tr>
                    <td>
                      3
                    </td>
                    <td>
                      <a>
                      ได้รับ 1/6 ของกองมรดกหากเจ้ามรดก (ผู้ตาย) มีพี่ หรือน้องเพียง (ไม่ว่าจะเป็นชาย หรือหญิง) หลายคน
                      </a> 
                    </td>
                    <td>
                      <a>
                        พี่หรือน้อง (ไม่ว่าจะเป็นชาย หรือหญิง) ของผู้ตาย จะได้รับมรดกของผู้ตาย 1/6 ในกรณีที่ผู้ตายมีพี่น้องไม่ว่าชาย หรือหญิงหลายคนร่วมอยู่ด้วย
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 3*/}

                  {/* ลำดับที่ 4*/}
                  <tr>
                    <td>
                      4
                    </td>
                    <td>
                      <a>
                        ได้รับ 1/3 ของกองมรดกหากเจ้ามรดก (ผู้ตาย) มีพี่น้องร่วมบิดามารดา
                      </a> 
                    </td>
                    <td>
                      <a>
                        พี่สาวหรือน้องสาวของผู้ตาย จะได้รับมรดกของผู้ตาย 1/3 ในกรณีที่พี่น้องร่วมบิดามารดามีสิทธิรับส่วนที่เหลือ
                      </a>
                    </td>
                  </tr> {/* จบลำดับที่ 4*/}                  
                 </table> {/*สิ้นสุดตาราง */} {/*จบลำดับ 2.1.11 พี่ หรือน้องร่วมแต่มารดา*/}
              </p>
            </div>
            {/* <img
              src={img1}
              alt="มรดก"
              className="w-11/12 block ml-auto mr-auto"
            /> */}
        </div>
      </div>

      <div>
        <h1 className="ml-4">แนะนำสำหรับคุณ</h1>
        <ul className="list__post">
          <li>
            <a className="text-indigo-700 underline" href="/islam/1">
              ความรู้ทั่วไปของกฎหมายมรดกอิสลาม
            </a>
          </li>
        </ul>
      </div>
    </>
  );
};

export default ทายาทอิส;
